Repository: chocoford/ExcalidrawZ
Catalog: ExcalidrawZ/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, hi, it, ja, ko, nl, pl, pt, ru, th, tr, vi, zh_hans, zh_hant

# migrationMoveContentToICloudDriveDescription
source: Moves file content from local database to unified file storage system (local + iCloud sync). This improves app performance by storing only file metadata locally while keeping actual file data in the file system.
ar: ينقل محتوى الملفات من قاعدة البيانات المحلية إلى نظام تخزين ملفات موحّد (محلي + مزامنة iCloud). يحسّن ذلك أداء التطبيق عن طريق تخزين بيانات تعريف الملفات محليًا فقط مع الاحتفاظ بالبيانات الفعلية للملف في نظام الملفات.
de: Verschiebt Dateiinhalte aus der lokalen Datenbank in ein einheitliches Dateispeichersystem (lokal + iCloud‑Sync). Dies verbessert die Leistung der App, indem nur Dateimetadaten lokal gespeichert werden, während die eigentlichen Dateien im Dateisystem verbleiben.
es: Mueve el contenido de los archivos desde la base de datos local a un sistema de almacenamiento unificado (local + sincronización con iCloud). Esto mejora el rendimiento de la aplicación al almacenar solo los metadatos de los archivos localmente, mientras mantiene los datos reales de los archivos en el sistema de archivos.
fr: Déplace le contenu des fichiers depuis la base de données locale vers un système de stockage unifié (stockage local + synchronisation iCloud). Cela améliore les performances de l'application en ne stockant localement que les métadonnées des fichiers, tandis que les données réelles sont conservées dans le système de fichiers.
hi: स्थानीय डेटाबेस से फ़ाइल सामग्री को एकीकृत फ़ाइल संग्रहण प्रणाली (स्थानीय + iCloud सिंक) में स्थानांतरित करता है। यह केवल फ़ाइल मेटाडेटा को स्थानीय रूप से संग्रहीत करके और वास्तविक फ़ाइल डेटा को फ़ाइल सिस्टम में रखकर ऐप के प्रदर्शन में सुधार करता है।
it: Sposta il contenuto dei file dal database locale a un sistema di archiviazione unificato (locale + sincronizzazione iCloud). Questo migliora le prestazioni dell'app memorizzando solo i metadati dei file localmente, mentre i dati effettivi dei file restano nel file system.
ja: ファイルの内容をローカルデータベースから統合ファイルストレージ（ローカル＋iCloud同期）へ移動します。実際のファイルデータをファイルシステムに保持し、ローカルにはファイルのメタデータのみを保存することで、アプリのパフォーマンスが向上します。
ko: 로컬 데이터베이스에서 통합 파일 저장 시스템(로컬 + iCloud 동기화)으로 파일 콘텐츠를 이동합니다. 이렇게 하면 실제 파일 데이터는 파일 시스템에 보관하고 로컬에는 파일 메타데이터만 저장하여 앱 성능이 향상됩니다.
nl: Verplaatst bestandsinhoud van de lokale database naar een verenigd bestandopslagsysteem (lokaal + iCloud-synchronisatie). Dit verbetert de app-prestaties doordat alleen bestandsmetadata lokaal worden opgeslagen, terwijl de daadwerkelijke bestandsgegevens in het bestandssysteem blijven.
pl: Przenosi zawartość plików z lokalnej bazy danych do zunifikowanego systemu przechowywania plików (lokalnie z synchronizacją iCloud). Poprawia to wydajność aplikacji — lokalnie przechowywane są tylko metadane plików, a rzeczywiste dane plików pozostają w systemie plików.
pt: Move o conteúdo dos arquivos do banco de dados local para um sistema unificado de armazenamento de arquivos (local + sincronização com iCloud). Isso melhora o desempenho do aplicativo ao armazenar apenas os metadados dos arquivos localmente, mantendo os dados reais dos arquivos no sistema de arquivos.
ru: Переносит содержимое файлов из локальной базы данных в единое файловое хранилище (локально + синхронизация с iCloud). Это повышает производительность приложения за счёт хранения в локальной базе данных только метаданных файлов, в то время как сами файлы остаются в файловой системе.
th: ย้ายเนื้อหาไฟล์จากฐานข้อมูลภายในเครื่องไปยังระบบเก็บไฟล์แบบรวม (พื้นที่เก็บในเครื่องและการซิงค์กับ iCloud) ช่วยปรับปรุงประสิทธิภาพแอปโดยเก็บเฉพาะข้อมูลเมตาของไฟล์ไว้ในเครื่อง ขณะที่ข้อมูลไฟล์จริงจะถูกเก็บไว้ในระบบไฟล์
tr: Dosya içeriğini yerel veritabanından birleşik dosya depolama sistemine (yerel + iCloud eşitlemeli) taşır. Bu, gerçek dosya verilerini dosya sisteminde tutarken sadece dosya meta verilerini yerel olarak saklayarak uygulama performansını iyileştirir.
vi: Di chuyển nội dung tệp từ cơ sở dữ liệu cục bộ sang hệ thống lưu trữ tệp hợp nhất (cục bộ + đồng bộ iCloud). Việc này cải thiện hiệu năng ứng dụng bằng cách chỉ lưu siêu dữ liệu tệp ở cục bộ trong khi giữ dữ liệu tệp thực tế trong hệ thống tệp.
zh_hans: 将文件内容从本地数据库迁移到统一的文件存储系统（本地 + iCloud 同步）。这通过在本地仅存储文件元数据并将实际文件数据保存在文件系统中来提升应用性能。
zh_hant: 將檔案內容從本機資料庫移至統一的檔案儲存系統（本機 + iCloud 同步）。這可改善應用程式效能：僅在本機儲存檔案的描述性資訊（metadata），而實際檔案資料則保存在檔案系統中。

# migrationMoveContentToICloudDriveName
source: Move Content To File Storage
ar: نقل المحتوى إلى نظام تخزين الملفات
de: In den Dateispeicher verschieben
es: Mover contenido al almacenamiento de archivos
fr: Déplacer le contenu vers le stockage de fichiers
hi: सामग्री को फ़ाइल संग्रहण में स्थानांतरित करें
it: Sposta contenuto nell'archivio file
ja: コンテンツをファイルストレージに移動
ko: 콘텐츠를 파일 저장소로 이동
nl: Inhoud verplaatsen naar bestandsopslag
pl: Przenieś zawartość do magazynu plików
pt: Mover Conteúdo para Armazenamento de Arquivos
ru: Перенести содержимое в файловое хранилище
th: ย้ายเนื้อหาไปยังที่เก็บไฟล์
tr: İçeriği Dosya Depolamaya Taşı
vi: Di chuyển nội dung vào lưu trữ tệp
zh_hans: 迁移内容到文件存储
zh_hant: 將內容移至檔案儲存

# migrationMoveContentToICloudDriveSkipAlertMessage
source: Are you sure to skip these files? Doing so will reset their contents.
ar: هل أنت متأكد من تخطي هذه الملفات؟ سيؤدي ذلك إلى إعادة ضبط محتوياتها.
de: Sind Sie sicher, dass Sie diese Dateien überspringen möchten? Dadurch werden deren Inhalte zurückgesetzt.
es: ¿Está seguro de omitir estos archivos? Al hacerlo, se restablecerá su contenido.
fr: Êtes-vous sûr de vouloir ignorer ces fichiers ? Cela réinitialisera leur contenu.
hi: क्या आप सुनिश्चित हैं कि आप इन फ़ाइलों को छोड़ना चाहते हैं? ऐसा करने पर उनकी सामग्री रीसेट हो जाएगी।
it: Sei sicuro di voler ignorare questi file? Così facendo il loro contenuto verrà azzerato.
ja: これらのファイルをスキップしてもよろしいですか？スキップすると内容がリセットされます。
ko: 정말로 이 파일들을 건너뛰시겠습니까? 이렇게 하면 해당 파일들의 내용이 초기화됩니다.
nl: Weet u zeker dat u deze bestanden wilt overslaan? Hierdoor wordt de inhoud ervan gereset.
pl: Czy na pewno chcesz pominąć te pliki? Spowoduje to zresetowanie ich zawartości.
pt: Tem certeza de que deseja ignorar estes arquivos? Isso redefinirá o conteúdo deles.
ru: Вы уверены, что хотите пропустить эти файлы? Это действие сбросит их содержимое.
th: คุณแน่ใจหรือไม่ว่าต้องการข้ามไฟล์เหล่านี้? การดำเนินการนี้จะรีเซ็ตเนื้อหาในไฟล์เหล่านี้
tr: Bu dosyaları atlamak istediğinizden emin misiniz? Bunu yaparsanız içerikleri sıfırlanacaktır.
vi: Bạn có chắc chắn muốn bỏ qua các tệp này? Việc làm như vậy sẽ đặt lại nội dung của chúng.
zh_hans: 确定要跳过这些文件吗？这样会重置它们的内容。
zh_hant: 確定要跳過這些檔案嗎？這樣做會重設它們的內容。

# migrationPhaseCheckingSubtitle
source: Checking if any migrations are needed...
ar: جارٍ التحقق مما إذا كانت هناك حاجة لأي ترحيلات...
de: Es wird geprüft, ob Migrationen erforderlich sind...
es: Comprobando si se necesitan migraciones...
fr: Vérification s'il est nécessaire d'effectuer des migrations...
hi: जाँचा जा रहा है कि क्या किसी माइग्रेशन की आवश्यकता है...
it: Verifica se sono necessarie migrazioni...
ja: 移行が必要かどうかを確認しています...
ko: 마이그레이션이 필요한지 확인 중...
nl: Controleren of migraties nodig zijn...
pl: Sprawdzanie, czy wymagane są migracje...
pt: Verificando se há migrações necessárias...
ru: Проверяется, требуются ли миграции...
th: กำลังตรวจสอบว่าจำเป็นต้องมีการย้ายข้อมูลหรือไม่...
tr: Herhangi bir geçişin gerekli olup olmadığı kontrol ediliyor...
vi: Đang kiểm tra xem có cần thực hiện di chuyển dữ liệu không...
zh_hans: 正在检查是否需要迁移...
zh_hant: 正在檢查是否需要任何遷移...

# migrationPhaseCheckingTitle
source: Checking for migrations...
ar: جارٍ التحقق من وجود ترحيلات...
de: Überprüfung auf Migrationen...
es: Comprobando migraciones...
fr: Vérification des migrations...
hi: माइग्रेशन की जाँच...
it: Verifica della presenza di migrazioni...
ja: 移行の確認中...
ko: 마이그레이션 확인 중...
nl: Controleren op migraties...
pl: Sprawdzanie migracji...
pt: Verificando migrações...
ru: Проверка миграций...
th: กำลังตรวจสอบการย้ายข้อมูล...
tr: Geçişler kontrol ediliyor...
vi: Đang kiểm tra di chuyển dữ liệu...
zh_hans: 正在检查迁移...
zh_hant: 正在檢查遷移...

# migrationPhaseClosedSubtitle
source: Your data has been successfully updated.
ar: تم تحديث بياناتك بنجاح.
de: Ihre Daten wurden erfolgreich aktualisiert.
es: Sus datos se han actualizado correctamente.
fr: Vos données ont été mises à jour avec succès.
hi: आपका डेटा सफलतापूर्वक अपडेट हो चुका है।
it: I tuoi dati sono stati aggiornati con successo.
ja: データは正常に更新されました。
ko: 데이터가 성공적으로 업데이트되었습니다.
nl: Uw gegevens zijn succesvol bijgewerkt.
pl: Twoje dane zostały pomyślnie zaktualizowane.
pt: Seus dados foram atualizados com sucesso.
ru: Ваши данные были успешно обновлены.
th: ข้อมูลของคุณได้รับการอัปเดตเรียบร้อยแล้ว
tr: Verileriniz başarıyla güncellendi.
vi: Dữ liệu của bạn đã được cập nhật thành công.
zh_hans: 您的数据已成功更新。
zh_hant: 您的資料已成功更新。

# migrationPhaseClosedTitle
source: Migration Completed
ar: اكتمل الترحيل
de: Migration abgeschlossen
es: Migración completada
fr: Migration terminée
hi: माइग्रेशन पूरा
it: Migrazione completata
ja: 移行が完了しました
ko: 마이그레이션 완료
nl: Migratie voltooid
pl: Migracja zakończona
pt: Migração Concluída
ru: Миграция завершена
th: การย้ายข้อมูลเสร็จสิ้น
tr: Geçiş Tamamlandı
vi: Di chuyển hoàn tất
zh_hans: 迁移已完成
zh_hant: 遷移完成

# migrationPhaseCompletedSubtitle
source: Your data has been successfully updated.
ar: تم تحديث بياناتك بنجاح.
de: Ihre Daten wurden erfolgreich aktualisiert.
es: Sus datos se han actualizado correctamente.
fr: Vos données ont été mises à jour avec succès.
hi: आपका डेटा सफलतापूर्वक अपडेट कर दिया गया है।
it: I tuoi dati sono stati aggiornati con successo.
ja: データは正常に更新されました。
ko: 데이터가 성공적으로 업데이트되었습니다.
nl: Uw gegevens zijn succesvol bijgewerkt.
pl: Twoje dane zostały pomyślnie zaktualizowane.
pt: Seus dados foram atualizados com sucesso.
ru: Ваши данные успешно обновлены.
th: ข้อมูลของคุณได้รับการอัปเดตเรียบร้อยแล้ว
tr: Verileriniz başarıyla güncellendi.
vi: Dữ liệu của bạn đã được cập nhật thành công.
zh_hans: 您的数据已成功更新。
zh_hant: 您的資料已成功更新。

# migrationPhaseCompletedTitle
source: Migration Completed
ar: اكتمل الترحيل
de: Migration abgeschlossen
es: Migración completada
fr: Migration terminée
hi: माइग्रेशन पूरा हुआ
it: Migrazione completata
ja: 移行が完了しました
ko: 마이그레이션 완료
nl: Migratie voltooid
pl: Migracja zakończona
pt: Migração concluída
ru: Миграция завершена
th: การย้ายข้อมูลเสร็จสมบูรณ์
tr: Aktarım Tamamlandı
vi: Di chuyển dữ liệu hoàn tất
zh_hans: 迁移完成
zh_hant: 遷移完成

# migrationPhaseErrorSubtitle
source: An error occurred during the migration process.
ar: حدث خطأ أثناء عملية الترحيل.
de: Bei der Migration ist ein Fehler aufgetreten.
es: Se produjo un error durante el proceso de migración.
fr: Une erreur est survenue lors de la migration.
hi: माइग्रेशन प्रक्रिया के दौरान एक त्रुटि हुई।
it: Si è verificato un errore durante il processo di migrazione.
ja: 移行中にエラーが発生しました。
ko: 마이그레이션 과정에서 오류가 발생했습니다.
nl: Er is een fout opgetreden tijdens het migratieproces.
pl: Wystąpił błąd podczas procesu migracji.
pt: Ocorreu um erro durante o processo de migração.
ru: Во время миграции произошла ошибка.
th: เกิดข้อผิดพลาดระหว่างกระบวนการย้ายข้อมูล
tr: Aktarım işlemi sırasında bir hata oluştu.
vi: Đã xảy ra lỗi trong quá trình di chuyển dữ liệu.
zh_hans: 迁移过程中发生错误。
zh_hant: 在遷移過程中發生錯誤。

# migrationPhaseErrorTitle
source: Migration Failed
ar: فشل الترحيل
de: Migration fehlgeschlagen
es: Migración fallida
fr: Échec de la migration
hi: माइग्रेशन विफल हुआ
it: Migrazione non riuscita
ja: 移行に失敗しました
ko: 마이그레이션 실패
nl: Migratie mislukt
pl: Migracja nie powiodła się
pt: Falha na migração
ru: Миграция не удалась
th: การย้ายข้อมูลล้มเหลว
tr: Aktarım Başarısız
vi: Di chuyển dữ liệu thất bại
zh_hans: 迁移失败
zh_hant: 遷移失敗

# migrationPhaseIdleWithoutPendingSubtitle
source: Your data is up to date.
ar: بياناتك محدثة.
de: Ihre Daten sind auf dem neuesten Stand.
es: Sus datos están actualizados.
fr: Vos données sont à jour.
hi: आपका डेटा अद्यतित है।
it: I tuoi dati sono aggiornati.
ja: データは最新の状態です。
ko: 데이터가 최신 상태입니다.
nl: Uw gegevens zijn up-to-date.
pl: Twoje dane są aktualne.
pt: Seus dados estão atualizados.
ru: Ваши данные актуальны.
th: ข้อมูลของคุณเป็นปัจจุบันแล้ว
tr: Verileriniz güncel.
vi: Dữ liệu của bạn đã được cập nhật.
zh_hans: 您的数据已是最新。
zh_hant: 您的資料已是最新。

# migrationPhaseIdleWithoutPendingTitle
source: No Migration Needed
ar: لا حاجة للترحيل
de: Keine Migration erforderlich
es: No se necesita migración
fr: Aucune migration nécessaire
hi: माइग्रेशन की आवश्यकता नहीं है
it: Nessuna migrazione necessaria
ja: 移行は不要です
ko: 마이그레이션 필요 없음
nl: Geen migratie nodig
pl: Migracja nie jest potrzebna
pt: Nenhuma migração necessária
ru: Миграция не требуется
th: ไม่จำเป็นต้องย้ายข้อมูล
tr: Aktarım Gerekli Değil
vi: Không cần di chuyển dữ liệu
zh_hans: 无需迁移
zh_hant: 不需要遷移

# migrationPhaseidleWithPendingSubtitle
source: We need to update your data to work with the latest version. You can archive your files first for safety.
ar: نحتاج إلى تحديث بياناتك لتتوافق مع أحدث إصدار. يمكنك أولاً أرشفة ملفاتك للحفاظ على سلامتها.
de: Wir müssen Ihre Daten aktualisieren, damit sie mit der neuesten Version funktionieren. Sie können zur Sicherheit zuerst Ihre Dateien archivieren.
es: Necesitamos actualizar sus datos para que funcionen con la versión más reciente. Puede archivar sus archivos primero por seguridad.
fr: Nous devons mettre à jour vos données pour qu'elles fonctionnent avec la dernière version. Vous pouvez d'abord archiver vos fichiers pour plus de sécurité.
hi: हमें आपके डेटा को नवीनतम संस्करण के साथ काम करने के लिए अपडेट करना होगा। सुरक्षा के लिए आप पहले अपनी फाइलें आर्काइव कर सकते हैं।
it: Dobbiamo aggiornare i tuoi dati per renderli compatibili con l'ultima versione. Puoi archiviare i tuoi file prima, per sicurezza.
ja: 最新バージョンで動作させるためにデータを更新する必要があります。安全のため、先にファイルをアーカイブすることをおすすめします。
ko: 최신 버전과 호환되도록 데이터를 업데이트해야 합니다. 안전을 위해 먼저 파일을 백업할 수 있습니다.
nl: We moeten uw gegevens bijwerken zodat ze compatibel zijn met de nieuwste versie. U kunt uw bestanden voor de zekerheid eerst archiveren.
pl: Musimy zaktualizować Twoje dane, aby działały z najnowszą wersją. Dla bezpieczeństwa możesz najpierw zarchiwizować pliki.
pt: Precisamos atualizar seus dados para que funcionem com a versão mais recente. Você pode arquivar seus arquivos antes, por segurança.
ru: Нам нужно обновить ваши данные, чтобы они работали с последней версией. Для безопасности вы можете сначала заархивировать файлы.
th: เราจำเป็นต้องอัปเดตข้อมูลของคุณเพื่อให้สามารถทำงานกับเวอร์ชันล่าสุด คุณสามารถสำรองไฟล์ก่อนเพื่อความปลอดภัย
tr: Verilerinizin en son sürümle uyumlu olması için güncelleme yapmamız gerekiyor. Güvenlik için önce dosyalarınızı arşivleyebilirsiniz.
vi: Chúng tôi cần cập nhật dữ liệu của bạn để tương thích với phiên bản mới nhất. Bạn có thể lưu trữ các tệp trước để đảm bảo an toàn.
zh_hans: 我们需要更新您的数据以适配最新版本。为安全起见，您可以先将文件归档。
zh_hant: 我們需要更新您的資料以配合最新版本。為安全起見，您可以先將檔案封存。

# migrationPhaseIdleWithPendingTitle
source: Migration Required
ar: الترحيل مطلوب
de: Migration erforderlich
es: Migración requerida
fr: Migration requise
hi: माइग्रेशन आवश्यक है
it: Migrazione necessaria
ja: 移行が必要です
ko: 마이그레이션 필요
nl: Migratie vereist
pl: Wymagana migracja
pt: Migração necessária
ru: Требуется миграция
th: จำเป็นต้องย้ายข้อมูล
tr: Aktarım Gerekiyor
vi: Cần di chuyển dữ liệu
zh_hans: 需要迁移
zh_hant: 需要遷移

# migrationPhaseInProgressSubtitle
source: Please wait while we update your data to work better with the latest version of the app.
ar: يرجى الانتظار بينما نقوم بتحديث بياناتك لتعمل بشكل أفضل مع أحدث إصدار من التطبيق.
de: Bitte warten Sie, während wir Ihre Daten aktualisieren, damit sie besser mit der neuesten Version der App funktionieren.
es: Por favor, espere mientras actualizamos sus datos para que funcionen mejor con la versión más reciente de la aplicación.
fr: Veuillez patienter pendant que nous mettons à jour vos données pour qu'elles fonctionnent mieux avec la dernière version de l'application.
hi: कृपया प्रतीक्षा करें, हम आपके डेटा को ऐप के नवीनतम संस्करण के साथ बेहतर ढंग से काम करने के लिए अपडेट कर रहे हैं।
it: Attendere mentre aggiorniamo i tuoi dati per farli funzionare meglio con l'ultima versione dell'app.
ja: 最新バージョンのアプリに対応するためデータを更新しています。しばらくお待ちください。
ko: 앱 최신 버전과 더 잘 작동하도록 데이터를 업데이트하는 동안 기다려 주세요.
nl: Wacht even terwijl we uw gegevens bijwerken zodat ze beter werken met de nieuwste versie van de app.
pl: Proszę czekać — aktualizujemy Twoje dane, aby lepiej działały z najnowszą wersją aplikacji.
pt: Aguarde enquanto atualizamos seus dados para funcionarem melhor com a versão mais recente do aplicativo.
ru: Пожалуйста, подождите, пока мы обновим ваши данные, чтобы они работали лучше с последней версией приложения.
th: กรุณารอในขณะที่เรากำลังอัปเดตข้อมูลของคุณเพื่อให้ทำงานได้ดียิ่งขึ้นกับเวอร์ชันล่าสุดของแอป
tr: Uygulamanın en son sürümüyle daha iyi çalışması için verilerinizi güncellerken lütfen bekleyin.
vi: Vui lòng đợi trong khi chúng tôi cập nhật dữ liệu của bạn để hoạt động tốt hơn với phiên bản mới nhất của ứng dụng.
zh_hans: 请稍候，我们正在更新您的数据，使其更好地适配应用的最新版本。
zh_hant: 請稍候，我們正在更新您的資料，以便更好地配合應用程式的最新版本。

# migrationPhaseInProgressTitle
source: Migrating your data
ar: جارٍ ترحيل بياناتك
de: Daten werden migriert
es: Migrando sus datos
fr: Migration de vos données
hi: आपका डेटा माइग्रेट किया जा रहा है
it: Migrazione dei dati in corso
ja: データを移行しています
ko: 데이터 마이그레이션 진행 중
nl: Uw gegevens worden gemigreerd
pl: Migracja danych
pt: Migrando seus dados
ru: Миграция данных
th: กำลังย้ายข้อมูลของคุณ
tr: Verileriniz aktarılıyor
vi: Đang di chuyển dữ liệu
zh_hans: 正在迁移您的数据
zh_hant: 正在遷移您的資料

# migrationPhaseMigratingButtonTitle
source: Migrating...
ar: جارٍ الترحيل...
de: Migration läuft...
es: Migrando...
fr: Migration en cours...
hi: माइग्रेट हो रहा है...
it: Migrazione in corso...
ja: 移行中...
ko: 마이그레이션 중...
nl: Bezig met migreren...
pl: Trwa migracja...
pt: Migrando...
ru: Идёт миграция...
th: กำลังย้ายข้อมูล...
tr: Aktarılıyor...
vi: Đang di chuyển...
zh_hans: 迁移中...
zh_hant: 正在遷移...

# migrationPhaseMigratingSubtitle
source: Please wait while we update your data to work better with the latest version of the app.
ar: يرجى الانتظار بينما نقوم بتحديث بياناتك لتعمل بشكل أفضل مع أحدث إصدار من التطبيق.
de: Bitte warten Sie, während wir Ihre Daten aktualisieren, damit sie besser mit der neuesten Version der App funktionieren.
es: Por favor, espere mientras actualizamos sus datos para que funcionen mejor con la versión más reciente de la aplicación.
fr: Veuillez patienter pendant que nous mettons à jour vos données pour qu'elles fonctionnent mieux avec la dernière version de l'application.
hi: कृपया प्रतीक्षा करें, हम आपके डेटा को ऐप के नवीनतम संस्करण के साथ बेहतर ढंग से काम करने के लिए अपडेट कर रहे हैं।
it: Attendere mentre aggiorniamo i tuoi dati per farli funzionare meglio con l'ultima versione dell'app.
ja: 最新バージョンのアプリに対応するためデータを更新しています。しばらくお待ちください。
ko: 앱 최신 버전과 더 잘 작동하도록 데이터를 업데이트하는 동안 기다려 주세요.
nl: Wacht even terwijl we uw gegevens bijwerken zodat ze beter werken met de nieuwste versie van de app.
pl: Proszę czekać — aktualizujemy Twoje dane, aby lepiej działały z najnowszą wersją aplikacji.
pt: Aguarde enquanto atualizamos seus dados para funcionarem melhor com a versão mais recente do aplicativo.
ru: Пожалуйста, подождите, пока мы обновим ваши данные, чтобы они работали лучше с последней версией приложения.
th: กรุณารอในขณะที่เรากำลังอัปเดตข้อมูลของคุณเพื่อให้ทำงานได้ดียิ่งขึ้นกับเวอร์ชันล่าสุดของแอป
tr: Uygulamanın en son sürümüyle daha iyi çalışması için verilerinizi güncellerken lütfen bekleyin.
vi: Vui lòng đợi trong khi chúng tôi cập nhật dữ liệu của bạn để hoạt động tốt hơn với phiên bản mới nhất của ứng dụng.
zh_hans: 请稍候，我们正在更新您的数据，使其更好地适配应用的最新版本。
zh_hant: 請稍候，我們正在更新您的資料，以便更好地配合應用程式的最新版本。

# migrationPhaseMigratingTitle
source: Migrating your data
ar: جارٍ ترحيل بياناتك
de: Daten werden migriert
es: Migrando sus datos
fr: Migration de vos données
hi: आपका डेटा माइग्रेट किया जा रहा है
it: Migrazione dei dati in corso
ja: データを移行しています
ko: 데이터 마이그레이션 진행 중
nl: Uw gegevens worden gemigreerd
pl: Migracja danych
pt: Migrando seus dados
ru: Миграция данных
th: กำลังย้ายข้อมูลของคุณ
tr: Verileriniz aktarılıyor
vi: Đang di chuyển dữ liệu
zh_hans: 正在迁移您的数据
zh_hant: 正在遷移您的資料

# migrationPhaseWaitingForSyncButtonTitle
source: Waiting for syncing...
ar: جاري المزامنة...
de: Warte auf Synchronisierung...
es: Esperando a que se sincronice...
fr: En attente de la synchronisation...
hi: सिंक होने की प्रतीक्षा...
it: In attesa della sincronizzazione...
ja: 同期を待っています…
ko: 동기화 대기 중...
nl: Wachten op synchronisatie...
pl: Oczekiwanie na synchronizację...
pt: Aguardando sincronização...
ru: Ожидание синхронизации...
th: กำลังรอการซิงค์...
tr: Eşitleme bekleniyor...
vi: Đang chờ đồng bộ...
zh_hans: 正在等待同步...
zh_hant: 等待同步…

# migrationPhaseWaitingForSyncSubtitle
source: Checking for updates from iCloud before proceeding...
ar: جارٍ التحقق من وجود تحديثات في iCloud قبل المتابعة...
de: Überprüfe vor dem Fortfahren, ob es Updates von iCloud gibt...
es: Comprobando si hay actualizaciones en iCloud antes de continuar...
fr: Vérification des mises à jour depuis iCloud avant de continuer...
hi: आगे बढ़ने से पहले iCloud से अपडेट्स की जाँच कर रहा है...
it: Verifico la presenza di aggiornamenti da iCloud prima di procedere...
ja: 続行する前にiCloudの更新を確認しています…
ko: 계속하기 전에 iCloud에서 업데이트를 확인하는 중...
nl: Controleren op iCloud-updates voordat er wordt doorgegaan...
pl: Sprawdzanie aktualizacji w iCloud przed kontynuowaniem...
pt: Verificando se há atualizações no iCloud antes de prosseguir...
ru: Проверка обновлений в iCloud перед продолжением...
th: กำลังตรวจหาการอัปเดตจาก iCloud ก่อนดำเนินการต่อ...
tr: Devam etmeden önce iCloud'daki güncellemeler kontrol ediliyor...
vi: Đang kiểm tra cập nhật từ iCloud trước khi tiếp tục...
zh_hans: 在继续之前检查来自 iCloud 的更新...
zh_hant: 在繼續之前檢查 iCloud 是否有更新…

# migrationPhaseWaitingForSyncTitle
source: Waiting for iCloud Sync...
ar: في انتظار مزامنة iCloud...
de: Warte auf iCloud-Synchronisierung...
es: Esperando la sincronización con iCloud...
fr: En attente de la synchronisation iCloud...
hi: iCloud सिंक होने की प्रतीक्षा...
it: In attesa della sincronizzazione con iCloud...
ja: iCloudの同期を待っています…
ko: iCloud 동기화 대기 중...
nl: Wachten op iCloud-synchronisatie...
pl: Oczekiwanie na synchronizację iCloud...
pt: Aguardando sincronização com o iCloud...
ru: Ожидание синхронизации iCloud...
th: กำลังรอการซิงค์ iCloud...
tr: iCloud eşitlemesi bekleniyor...
vi: Đang chờ đồng bộ iCloud...
zh_hans: 正在等待 iCloud 同步...
zh_hant: 等待 iCloud 同步…

# migrationSheetArchiveDescription
source: Export all files and import them to the new version of ExcalidrawZ.
ar: قم بتصدير جميع الملفات واستيرادها إلى الإصدار الجديد من ExcalidrawZ.
de: Exportieren Sie alle Dateien und importieren Sie sie in die neue Version von ExcalidrawZ.
es: Exporta todos los archivos e impórtalos a la nueva versión de ExcalidrawZ.
fr: Exportez tous les fichiers et importez-les dans la nouvelle version d'ExcalidrawZ.
hi: सभी फ़ाइलों का निर्यात करें और उन्हें नए संस्करण में आयात करें ExcalidrawZ।
it: Esporta tutti i file e importali nella nuova versione di ExcalidrawZ.
ja: すべてのファイルをエクスポートし、新しいバージョンの ExcalidrawZ にインポートしてください。
ko: 모든 파일을 내보내고 새 버전의 ExcalidrawZ에 가져오세요.
nl: Exporteer alle bestanden en importeer ze naar de nieuwe versie van ExcalidrawZ.
pl: Eksportuj wszystkie pliki i zaimportuj je do nowej wersji ExcalidrawZ.
pt: Exporte todos os arquivos e importe-os para a nova versão do ExcalidrawZ.
ru: Экспортируйте все файлы и импортируйте их в новую версию ExcalidrawZ.
th: ส่งออกรายการทั้งหมดและนำเข้าไปยังเวอร์ชันใหม่ของ ExcalidrawZ
tr: Tüm dosyaları dışa aktarın ve bunları yeni ExcalidrawZ sürümüne içe aktarın.
vi: Xuất tất cả tệp và nhập chúng vào phiên bản mới của ExcalidrawZ.
zh_hans: 导出所有文件并将其导入新版 ExcalidrawZ。
zh_hant: 導出所有文件並將其導入到新的 ExcalidrawZ 版本中。
